<a href="https://colab.research.google.com/github/ratfarts/datasciencecoursera/blob/master/Copy_of_String_Manipulation_in_SQL_Live_training_student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<p align="center">
<img src="https://raw.githubusercontent.com/datacamp/string-manipulation-in-sql-live-training/master/assets/datacamp.svg" alt = "DataCamp icon" width="50%">
</p>
<br><br>

## **String Manipulation in SQL**

Welcome to the DataCamp "String Manipulation in SQL", where we will be covering a deep dive into a variety of techiques you can use to manipulate sting data in your SQL queries. Through a hands on coding session you will learn how to use PostgreSQL to answer our real world questions about a Short Term Rentals dataset from Cambridge, MA.

In today's notebook, you will learn:

- Explore a dataset in a SQL database by examining table structure and data types
- Converting or casting common data types
- How to manipulate string data using built-in string and character functions
- Create temporary tables and use them to simplify complex queries
- Learn how to use temporary tables to create new fields from unstructured string data
- Create user defined functions that can be used to simplify data manipulation tasks

## **The Dataset**

This data is taken from a .csv file called "short_term_rentals". As today's session will focus on creating queries. It contains the following columns.

- `id`: Unique identifier for rental ID
- `issue_date`: Date of Issue for the Short Term Rental certificate
- `status`: Application status.
- `location`: Rental Location
- `property_type`: Description of the building property type.
- `property_type_additional_description`: Additional building property type information.
- `condo_association`: Is the Short-Term Rental Unit part of a condominium association?
- `total_bedrooms`: Total number of legal bedrooms in the short-term rental unit
- `rented_bedrooms`: Number of legal bedrooms to be rented as part of this application.
- `maximum_renter_capacity`: Maximum number of people to which the short term rental will be rented.
- `kitchen`: Will the kitchen be available to the renter?
- `bathrooms`: Number of bathrooms available to the renter.
- `all_rental_services`: A single column list of all rental services used by this property.

## **Setting up PostgreSQL**

In [0]:
#@title **This block of code will install PosgreSQL**
%%capture
!wget -qO- https://www.postgresql.org/media/keys/ACCC4CF8.asc | apt-key add -
!echo "deb http://apt.postgresql.org/pub/repos/apt/ bionic-pgdg main" >/etc/apt/sources.list.d/pgdg.list
!apt -qq update
!apt -yq install postgresql-12 postgresql-client-12
!service postgresql start
# make calling psql shorter
!sudo -u postgres psql -c "CREATE USER root WITH SUPERUSER"  
!psql postgres -c "CREATE DATABASE root"  # now just !psql -c "..."
# load SQL extensions
%load_ext sql
%config SqlMagic.feedback=False 
%config SqlMagic.autopandas=True
%sql postgresql+psycopg2://@/postgres

In [0]:
#@title **This will download your data to local environment**
!wget -q https://raw.githubusercontent.com/datacamp/string-manipulation-in-sql-live-session/master/data/short_term_rentals.csv

In [4]:
#@title **This will create your table**
%%sql
-- Make sure to amend you table name, column names and types
DROP TABLE IF EXISTS rentals;
CREATE TABLE rentals(
 id int primary key,
 issue_date text,
 status text,
 location text,
 short_term_rental_type text,
 property_type text,
 property_type_additional_description text,
 condo_association text,
 total_bedrooms numeric,
 rented_bedrooms numeric,
 maximum_renter_capacity numeric,
 kitchen text,
 bathrooms numeric,
 all_rental_services text
);
COPY rentals
-- Make sure to point to correct file and delimiter 
FROM '/content/short_term_rentals.csv' DELIMITER ',' CSV HEADER;

 * postgresql+psycopg2://@/postgres

Empty DataFrame
Columns: []
Index: []

# **Exploring the Dataset**

In [5]:
%%sql

-- View the entire dataset
select *
FROM rentals;

 * postgresql+psycopg2://@/postgres

        id        issue_date  ... bathrooms     all_rental_services
0    13727     March 27 2018  ...         1        Airbnb, HomeAway
1    14766     April 26 2018  ...         1                  Airbnb
2    13941   January 13 2020  ...         1                  Airbnb
3    54029  November 27 2019  ...         1  Airbnb, HomeAway, VRBO
4    46488      July 09 2019  ...         2                  Airbnb
..     ...               ...  ...       ...                     ...
276  13856     April 05 2019  ...         3                  Airbnb
277  48801   January 16 2020  ...         1                  Airbnb
278  31371     April 08 2019  ...         1                  Airbnb
279  44924       May 09 2019  ...         1                  Airbnb
280  13922       May 16 2019  ...         1        Airbnb, HomeAway

[281 rows x 14 columns]

In [6]:
%%sql

-- Sort the dataset by issue_date
select *
from rentals
order by issue_date
limit 5;

 * postgresql+psycopg2://@/postgres

      id  ...                                all_rental_services
0  13734  ...                                             Airbnb
1  13676  ...  Airbnb, bedandbreakfast.com; avonhillhouse dot...
2  13990  ...                                             Airbnb
3  13682  ...                                       Airbnb, VRBO
4  13972  ...                                             Airbnb

[5 rows x 14 columns]

In [7]:
%%sql

-- Sort the dataset by issue_date
select *
from rentals
order by issue_date DESC
limit 5;

 * postgresql+psycopg2://@/postgres

      id         issue_date  ... bathrooms                 all_rental_services
0  18433  September 25 2019  ...         2                              Airbnb
1  16481  September 20 2019  ...         2                              Airbnb
2  20166  September 20 2018  ...         1  Airbnb, Harvard Off Campus Housing
3  49891  September 11 2019  ...         1                              Airbnb
4  54783  September 09 2019  ...         1                              Airbnb

[5 rows x 14 columns]

In [9]:
%%sql

-- Show the ID,  location and all_rental_services columns
select id, location, all_rental_services
from rentals
limit 5;

 * postgresql+psycopg2://@/postgres

      id  ...     all_rental_services
0  13727  ...        Airbnb, HomeAway
1  14766  ...                  Airbnb
2  13941  ...                  Airbnb
3  54029  ...  Airbnb, HomeAway, VRBO
4  46488  ...                  Airbnb

[5 rows x 3 columns]

## **Q&A**

# **Getting our data analysis-ready**

Looking more closely at the Short Term Rentals dataset, there are several adjustments that need to be made to the data before we can get some meaningful insights.

_Data type problems:_

- **Problem 1**: First, the `issue_date` column needs to be converted to a date/time value before we can look at timeseries data.

- **Problem 2**: We'll need split the `all_rental_serivces` column so we can know who our competitors are in the city before we launch the pilot.

- **Problem 3**: Removing leading and trailing whitespace from data is a common data cleaning task that you will run into often and this data set is no exception.

<br>

_Text/categorical data problems:_

- **Problem 4**: To get any aggregated insights about where in the city rental applications are most prevalent, we'll have to break apart the `location` column into it component address fields.

- **Problem 5**: Looking at the rental services in our dataset there are several that only have a single listing and we'll want to combine all these services into a single `'other'` category.


## **Our to do list:**

_Data type problems:_

- **Task 1**: Convert `issue_date` from `text` data type to `date`
- **Task 2**: Split the `all_rental_services` values into individual services
- **Task 3**: Remove leading and trailing whitespace form the individual services from Task 2

<br>

_Text/categorical data problems:_

- **Task 4**: Create an `'other'` category as a "catch-all" for outlier rental services
- **Task 5**: Parse the `location` column into component address fields (i.e., zip code)

## **Task 1: Converting data from one type to another using `CAST()`**

Let's get started by converting the `issue_date` to a date value.  Looking at the data as it's currently stored in the database, it appears that the column stores the month, day and year that the rental certification was issue but it's stored as a `TEXT` data type. 

To convert columns from one data type to another in PostgreSQL, we can use the `CAST()` function as below here:

>```sql
SELECT cast(column_name as new_type) 
FROM table;
```

Since `issue_date` does not contain time, we can convert it to DATE instead of TIMESTAMP.

In [10]:
%%sql

-- Convert issue_date to a date
select id, cast(issue_date as date)
from rentals
limit 5;

 * postgresql+psycopg2://@/postgres

      id  issue_date
0  13727  2018-03-27
1  14766  2018-04-26
2  13941  2020-01-13
3  54029  2019-11-27
4  46488  2019-07-09

Now if we try to sort the dataset by the converted `issue_date` field, let's see if we get expected results.

In [12]:
%%sql

-- Convert issue_date to a date and sort ascending
select id, cast(issue_date as date)
from rentals
order by cast(issue_date as date) desc;

 * postgresql+psycopg2://@/postgres

        id  issue_date
0    11943  2020-04-15
1    11950  2020-04-15
2    13957  2020-04-13
3    13956  2020-04-13
4    13885  2020-04-13
..     ...         ...
276  12112  2018-03-26
277  13577  2018-03-26
278  13313  2018-03-26
279  13583  2018-03-26
280  12140  2018-03-26

[281 rows x 2 columns]

## **Task 2: Using `ARRAYS` to manipulate strings stored as comma-separated-values**

In [13]:
%%sql

-- Use string_to_array() to convert the all_rental_services from a comma-separated-list to an array

select id, string_to_array(all_rental_services,',')
from rentals
limit 5;

 * postgresql+psycopg2://@/postgres

      id             string_to_array
0  13727         [Airbnb,  HomeAway]
1  14766                    [Airbnb]
2  13941                    [Airbnb]
3  54029  [Airbnb,  HomeAway,  VRBO]
4  46488                    [Airbnb]

PostgreSQL has a function called `unnest()` that will take an array and create unique rows for each index. Let's see what happens when we use the `unnest()` function on the result of `string_to_array()` for the first rental id 13727.

In [15]:
%%sql

-- Nest the string_to_array() function in unnest() to transpose the array into multiple unique rows.
select id, unnest(string_to_array(all_rental_services, ','))
from rentals
where id = 13727;

 * postgresql+psycopg2://@/postgres

      id     unnest
0  13727     Airbnb
1  13727   HomeAway

A subquery is useful in this example becaues it will allow us to perform additional operations on the rental services data after we have parsed it using the `string_to_array()` and `unest()` functions.

Here's an example of a simple subquery for  your reference.
>```sql
SELECT AVG(column_name) 
FROM
(
    SELECT * FROM table
)
GROUP BY column_name;
```

In [19]:
%%sql

-- Use the results from the unnest() function in the query

select services, count(id) as total
from
(
select id,unnest(string_to_array(all_rental_services, ','))
from rentals
) as dt(id, services)
group by services
order by total desc;

 * postgresql+psycopg2://@/postgres

                                       services  total
0                                        Airbnb    273
1                                      HomeAway     37
2                                          VRBO     23
3                                    Craigslist     17
4                                Boston_Rentals     16
5                                       FlipKey     15
6                                 Couch_Surfing     10
7                                                    2
8                Bed &amp; Breakfast Associates      1
9                                       website      1
10                     Colbyco Vacation Rentals      1
11                                     HomeAway      1
12                        Bay Colony Associates      1
13    I have had an agent for these nine years.      1
14                                    Hotel.com      1
15                                       eviivo      1
16                   Harvard Off Campus Housing      1
17                                bnbboston.com      1
18          Parkside (GoDaddy Host) TripAdvisor      1
19       Bed and Breakfast Associate Bay Colony      1
20   bedandbreakfast.com; avonhillhouse dot com      1
21                                         VRBO      1
22                                  MisterBandB      1
23                             Sabbatical Homes      1
24                                      Expedia      1

## **Task 3: Removing leading and trailing whitespace**

Take a close look at the results from the previous task.  It appears that there are two instances of `HomeAway` and `VBRO`.  This is the result of having whitespace in between each value of the comma-separated-list.  We can clean this up by removing the leading and trailing whitespace from the data by using the `trim()` function.

In [0]:
%%sql

-- Remove whitespace from the results of the unnest() function in the query

In [20]:
%%sql

-- Use the results from the unnest() function in the query

select trim(services) service, count(id) as total
from
(
select id,unnest(string_to_array(all_rental_services, ','))
from rentals
) as dt(id, services)
group by service
order by total desc;

 * postgresql+psycopg2://@/postgres

                                       service  total
0                                       Airbnb    273
1                                     HomeAway     38
2                                         VRBO     24
3                                   Craigslist     17
4                               Boston_Rentals     16
5                                      FlipKey     15
6                                Couch_Surfing     10
7                                                   2
8                                      website      1
9                     Colbyco Vacation Rentals      1
10      Bed and Breakfast Associate Bay Colony      1
11  bedandbreakfast.com; avonhillhouse dot com      1
12                                     Expedia      1
13   I have had an agent for these nine years.      1
14                                 MisterBandB      1
15                                      eviivo      1
16         Parkside (GoDaddy Host) TripAdvisor      1
17                               bnbboston.com      1
18                            Sabbatical Homes      1
19                       Bay Colony Associates      1
20                  Harvard Off Campus Housing      1
21                                   Hotel.com      1
22              Bed &amp; Breakfast Associates      1

## **Q&A**

## **Task 4: Using `CASE` statements to create new categorical fields**

Notice that the results from the previous query, include many rental services with only one location that is using them.  For our analysis, we don't want to exclude these locations but it would be easier if they were all grouped together in an `'other'` category.  We can do this in our query using a `CASE` statement.

>```sql
CASE
     WHEN condition_1  THEN result_1
     WHEN condition_2  THEN result_2
     ...
     ELSE  result_n
END
```

In [22]:
%%sql

-- Create a new field called rentalService from the services data
select  case when trim(services) IN('Airbnb', 'HomeAway', 'VRBO', 'FlipKey', 
                                    'Craigslist', 'Boston_Rentals', 'Couch_Surfing') 
  then trim(services) else 'Other' end as rentalService, 

count(id) as total
from
(
select id,unnest(string_to_array(all_rental_services, ','))
from rentals
) as dt(id, services)
group by rentalService
order by total desc;

 * postgresql+psycopg2://@/postgres

    rentalservice  total
0          Airbnb    273
1        HomeAway     38
2            VRBO     24
3      Craigslist     17
4           Other     17
5  Boston_Rentals     16
6         FlipKey     15
7   Couch_Surfing     10

## **Task 5: Extracting string data using `SUBSTRING()` and `POSITION()`**

Great work!  Now let's see what we can do with the `location` field.  Ideally, we would have columns for each address part including street address, postal code, etc. In order to do this we'll need to parse the `location` field into these parts. 

To divide strings (or extract substrings) in PostgreSQL, we can use `SUBSTRING`(column_name, substring_start_position, substring_end_position)` where:

> `column_name` is the name of the column being processed
<br> `substring_start_position` is the numbered position of the first string of the substring being extracted.
<br> `substring_end_position` is the numbered position of the substring of the last string of the substring being extracted.

A common value from the location column has the format:

> `street_address \n city_state_zip \n lat_long`
<br> <br>For example: `65 Pearl St\nCambridge, MA 02139\n(42.363228, 42.36322)`

To divide `location` into substrings, will divide it based on the position of the break-line character `\n` by using the `POSITION(character IN column_name)` function which finds the numbered position of a character in a string column, as well as the `chr(10)` function which returns `\n`.

In [28]:
%%sql

-- Use substring() and position() functions to parse the location into various address values

select substring(location, 0, position(chr(10) IN location)) as street_address,
      substring(location, position(chr(10) IN location)+1,19) as city_state_zip,
      substring(location, position('(' IN location), position (')' IN location)) as lat_lon
from rentals;

select substring(location, 0, 19), position(E'\n' IN location)
from rentals;

 * postgresql+psycopg2://@/postgres

               substring  position
0    65 Pearl St\nCambri        12
1    34 Essex St\nCambri        12
2     24 Corporal Mctern        24
3    152 Berkshire St\nC        17
4    26 Sacramento St\nC        17
..                   ...       ...
276  53 Ellery St\nCambr        13
277  42 Bowdoin St\nCamb        14
278  184 Green St\nCambr        13
279  100 Auburn St\nCamb        14
280  51 Avon Hill St\nCa        16

[281 rows x 2 columns]

### **Extracting string data using `split_part()`**

The `split_part()` function parses string data based on a specified delimiter into an `ARRAY` and allows access to each array index by specifying the index value as a parameter in the function.  The query above can be rewritten using the `split_part()` function which as you'll see actually simplifies the query.

<p align="center">
<img src="https://user-images.githubusercontent.com/48436758/83009911-c3ecf600-a017-11ea-81c6-2ae5b179fcc1.png" alt = "split_part graphic" width="100%">
</p>
<br><br>

In [27]:
%%sql

-- Use split_part() to parse the location into various address values
select split_part(location, chr(10), 1) as street_address,
        split_part(location, chr(10), 2) as city_state_zip,
        split_part(location, chr(10), 3) as lat_lon
from rentals;

 * postgresql+psycopg2://@/postgres

              street_address       city_state_zip                  lat_lon
0                65 Pearl St  Cambridge, MA 02139  (42.363228, -71.104202)
1                34 Essex St  Cambridge, MA 02139  (42.366748, -71.101654)
2    24 Corporal Mcternan St  Cambridge, MA 02139  (42.361299, -71.108347)
3           152 Berkshire St  Cambridge, MA 02141  (42.372124, -71.089837)
4           26 Sacramento St  Cambridge, MA 02138  (42.382554, -71.117114)
..                       ...                  ...                      ...
276             53 Ellery St  Cambridge, MA 02138  (42.372064, -71.110188)
277            42 Bowdoin St  Cambridge, MA 02138  (42.383883, -71.121647)
278             184 Green St  Cambridge, MA 02139  (42.363624, -71.102262)
279            100 Auburn St  Cambridge, MA 02139  (42.362472, -71.103169)
280          51 Avon Hill St  Cambridge, MA 02138  (42.384815, -71.124425)

[281 rows x 3 columns]

## **What Have We Learned About the Short Term Rentals Data?**

So far, we have discovered:

*   The rentals dataset contains data from March, 2018 through April, 2020.
*   The short term rentals market has about 22 different services.
*   But there are only 7 rental services with more than one locationt using them.

## **Q&A**

# **Techniques for query simplification and code reuse**

Sometimes when you encounter data that needs to be transformed or manipulated before being usable in queries, you may decide that creating a temporary table or user-defined function with the result of your data manipulation will simplify your data analysis queries or allow for code reuse in multiple queries. 

Let's explore some techniques by first looking at how to use temporary tables

## **Creating a temporary table with our rental services data**

A temporary table in PostgeSQL is equivalent to a permanent disk-based table created in a database but only exists during the duration of the database session. PostgreSQL will automatically drop the table at the end of the session or 

>```sql
DROP TABLE IF EXISTS temp_table;
CREATE TEMP[ORARY] TABLE temp_table(
   ...
);
```

In [0]:
%%sql

-- Create a temporary table called rental_services

In [0]:
%%sql

-- Create a temporary table called address

## **Using temporary tables to simplify complex queries**

Once the temporary tables are created, your queries become much simpler and easier to manage, and you have the ability to run multiple queries against the temporary table which streamlines reuse.

We will use an `INNER JOIN` to combine the results from the newly created temporary tables `address` and `rental_services`.  As a review, an `INNER JOIN` will return rows that are in both table A and table B as highlighted in the image below. 

![sql joins](https://user-images.githubusercontent.com/48436758/83012005-1b409580-a01b-11ea-99b8-7bb73a822fb7.png)

For example:

>```sql
SELECT table_1_alias.* , table_2_alias.*<br> 
FROM table_1 AS table_1_alias INNER JOIN table_2 AS table_2_alias 
ON table_1_alias.common_column = table_2_alias.common_column;
```

In [0]:
%%sql

-- Select all rows from both the address and rental_services temporary tables

In [0]:
%%sql

-- Calculate the total rentals by service and zip code

## **User-defined functions to create reusable code**

A user-defined function is the PostgeSQL equivalent of a stored procedure where you can bundle several SQL queries and statements together into a single package using the `CREATE FUNCTION` command. 

>```sql
CREATE [OR REPLACE] FUNCTION function_name(p1 type, p2 type)
 RETURNS type AS $$
 BEGIN
 -- logic
 END;
$$ LANGUAGE language_name;
```

In [0]:
%%sql

-- Create a user-defined function to get zip code from the location column

# **Case study: Analyzing competitors and the best locations for short term rentals**

Let's now use our new data manipulation skills to dig deeper into the short term rentals data to determine if Cambridge, MA is a good spot to pilot our new short term rentals app.

First, we'll see what the growth rate has been over the past couple of years with registrations.

Next we'll see what the most popular rental services are in the town.

And finally we'll take a look at which zip codes in the city have the largest number of rental units.  

Let's get started.

In [0]:
%%sql

-- Calculate the number of rentals registered by year

In [0]:
%%sql

-- Calculate the number of rentals by service for the top 7 rental services

In [0]:
%%sql

-- Calculate the total number of rentals by zip code

# **Q&A**